{
  "version": "spell-templates-v2",
  "templates": [
    {
      "key": "fireball",
      "aliases": ["fireball", "fire ball", "flame orb", "flaming orb"],
      "expansion": "A blazing sphere of crimson fire streaks forward and erupts on impact, igniting enemies in the blast radius with burning damage over time and heavy upfront impact."
    },
    {
      "key": "wall",
      "aliases": ["wall", "stone wall", "arcane wall", "barrier"],
      "expansion": "A broad shimmering wall sweeps across the lane, forcing enemies back, disrupting their advance, and dealing sustained contact damage to units caught in its path."
    },
    {
      "key": "frost",
      "aliases": ["frost", "ice ring", "frost ring", "ring of ice"],
      "expansion": "A circular burst of blue frost blooms across the battlefield, chilling enemies inside its reach, slowing movement speed, and applying freezing control pressure."
    },
    {
      "key": "bolt",
      "aliases": ["bolt", "lightning bolt", "chain lightning", "zap"],
      "expansion": "A crackling storm bolt lashes from target to target, arcing electric damage through clustered enemies while applying a brief slowing shock effect."
    },
    {
      "key": "meteor",
      "aliases": ["meteor", "meteor strike", "falling star", "skyfire"],
      "expansion": "A burning meteor tears through the sky and slams into the battlefield, creating a massive fiery impact zone that deals high burst damage and leaves scorched ground that continues to burn enemies."
    },
    {
      "key": "quake",
      "aliases": ["quake", "earthquake", "seismic slam", "ground rupture"],
      "expansion": "A violent seismic pulse fractures the lane in a widening shockwave, knocking enemies off balance, dealing heavy earth damage, and briefly stunning tightly packed front lines."
    },
    {
      "key": "vortex",
      "aliases": ["vortex", "arcane vortex", "gravity well", "void whirl"],
      "expansion": "A swirling arcane vortex opens at target position, dragging nearby enemies inward while dealing sustained magical damage and compressing groups into a vulnerable cluster."
    },
    {
      "key": "sunlance",
      "aliases": ["sunlance", "solar lance", "sun beam", "radiant spear"],
      "expansion": "A focused lance of searing sunlight pierces straight through a lane, dealing piercing radiant damage to enemies in a long line and applying a brief burn to survivors."
    },
    {
      "key": "blizzard",
      "aliases": ["blizzard", "snowstorm", "whiteout", "icy tempest"],
      "expansion": "A roaming blizzard cloud sweeps over enemy lanes, pelting units with freezing shards that slow movement severely, stack chill effects, and occasionally freeze weaker targets in place."
    },
    {
      "key": "shadowflame",
      "aliases": ["shadowflame", "dark fire", "black flame", "umbral blaze"],
      "expansion": "An unstable mix of shadow and flame erupts in smoky black-red bursts, inflicting both immediate fire damage and lingering arcane corruption that weakens enemy resilience."
    },
    {
      "key": "tidal surge",
      "aliases": ["tidal surge", "tidal wave", "tsunami", "sea surge", "deluge"],
      "expansion": "A towering wall of enchanted water crashes down the lane, sweeping enemies backward, dealing repeated impact damage, and drenching targets to amplify follow-up storm effects."
    },
    {
      "key": "thornfield",
      "aliases": ["thornfield", "bramble field", "spike vines", "entangling roots"],
      "expansion": "A field of razor-thorn vines erupts from the ground, rooting and slowing advancing enemies while dealing constant puncture damage to anything trying to push through."
    },
    {
      "key": "phoenix dive",
      "aliases": ["phoenix dive", "phoenix strike", "rebirth flame", "firebird dive"],
      "expansion": "A blazing phoenix silhouette dives into enemy ranks, detonating in a ring of rebirth fire that deals explosive damage, ignites targets, and briefly clears space near the impact point."
    },
    {
      "key": "storm cage",
      "aliases": ["storm cage", "lightning cage", "thunder prison", "tempest cage"],
      "expansion": "A cylindrical cage of rotating lightning forms around a target cluster, trapping enemies inside while chaining electric arcs that deal repeated damage and slow escape attempts."
    },
    {
      "key": "time snare",
      "aliases": ["time snare", "time warp", "chrono field", "temporal lock"],
      "expansion": "A warped temporal field blooms over the lane, dramatically reducing enemy movement and attack cadence while dealing low steady arcane damage as time pressure crushes trapped units."
    },
    {
      "key": "mirror shards",
      "aliases": ["mirror shards", "crystal barrage", "prism burst", "glass rain"],
      "expansion": "A cloud of razor crystal shards refracts and ricochets through enemies, dealing repeated arcane-piercing hits and scattering damage across tightly grouped formations."
    },
    {
      "key": "blood moon",
      "aliases": ["blood moon", "lunar curse", "crimson moon", "moonhex"],
      "expansion": "A crimson lunar curse settles over the battlefield, marking enemies with a damage-amplifying hex that increases incoming spell damage and punishes clustered targets over time."
    },
    {
      "key": "dragon breath",
      "aliases": ["dragon breath", "wyrm flame", "inferno breath", "drake roar"],
      "expansion": "A cone of molten dragonfire roars forward in a sweeping stream, scorching a wide front arc with intense burn damage and pushing lighter enemies back from the blast."
    },
    {
      "key": "void prison",
      "aliases": ["void prison", "arcane prison", "astral cage", "dimensional lock", "soul lock"],
      "expansion": "Ancient runes flare into a circular prison of void energy, binding clustered enemies in place while electric silence and tremoring shocks crack over them."
    },
    {
      "key": "rune lattice",
      "aliases": ["rune lattice", "glyph lattice", "arcane lattice", "binding glyphs", "sigil net"],
      "expansion": "A lattice of radiant glyph sigils locks onto enemy signatures, chaining burst-light between them and amplifying vulnerability through arcane resonance."
    },
    {
      "key": "holy nova",
      "aliases": ["holy nova", "radiant nova", "divine flare", "sacred burst", "luminous detonation"],
      "expansion": "A bright holy detonation erupts in brilliant concentric rings, burning wicked targets while briefly stunning nearby enemies and scattering weak lines of force."
    },
    {
      "key": "ember cyclone",
      "aliases": ["ember cyclone", "fire cyclone", "inferno cyclone", "flame vortex", "pyro vortex"],
      "expansion": "A roaring vortex of ember fire sweeps forward as a twisting cyclone, burning everything in its path and shoving enemies outward with repeated knockback pulses."
    },
    {
      "key": "crystal rain",
      "aliases": ["crystal rain", "prism rain", "shard hail", "glass hail", "crystal hail"],
      "expansion": "Hundreds of razor-edged crystal motes spiral through the air and ricochet across lanes, fragmenting damage across dense enemy groups."
    },
    {
      "key": "storm maelstrom",
      "aliases": ["storm maelstrom", "maelstrom", "thunder maelstrom", "electric spiral", "tempest whirl"],
      "expansion": "A spinning, high-voltage maelstrom forms above the lane and tears through enemies in a sweeping storm path with shock-chain arcs and crushing slow-down pressure."
    },
    {
      "key": "lunar eclipse",
      "aliases": ["lunar eclipse", "blood eclipse", "moon eclipse", "eclipse"],
      "expansion": "A dark moon-sigil eclipses the battlefield in chilled shadow-fire, layering burn and frost pressure while suppressing enemy coordination."
    },
    {
      "key": "frostbound vault",
      "aliases": ["frostbound vault", "ice vault", "frozen vault", "glacial vault", "arctic vault"],
      "expansion": "A vault of crystalline frost and sharp wind rises from the ground, immobilizing front-line enemies while pummeling them with freezing projectiles from above."
    },
    {
      "key": "inferno stampede",
      "aliases": ["inferno stampede", "fire stampede", "blazing stampede", "magma stampede", "lava stampede"],
      "expansion": "A wave of burning impact points races down the lane in staggered timing, chaining explosion pressure and staggering survivors with repeated concussion pushes."
    },
    {
      "key": "moonwarden",
      "aliases": ["moonwarden", "silver ward", "lunar ward", "moon ward", "astral ward"],
      "expansion": "A reflective lunar ward deploys with radiant mirrors that blind and stagger incoming lines, then collapses into a delayed burst at the end of its hold."
    },
    {
      "key": "gale spear",
      "aliases": ["gale spear", "wind spear", "tempest spear", "air spear", "storm lance"],
      "expansion": "A line-piercing gale-lance cuts across the lane at commander angle, channeling air pressure with repeated impact pulses and piercing follow-up arcs."
    },
    {
      "key": "gravebrand",
      "aliases": ["gravebrand", "dreadbrand", "curse brand", "necrotic brand"],
      "expansion": "A black-fire brand marks enemies with unstable curse energy, increasing subsequent spell damage and causing stacked recoil when clustered."
    },
    {
      "key": "void comet",
      "aliases": ["void comet", "black comet", "dark star", "abyssal strike", "astral comet"],
      "expansion": "A spectral comet punches through the skies and detonates on impact, shredding formations with burning arcane shock and leaving a crumbling gravity pocket behind it."
    },
    {
      "key": "aurora spear",
      "aliases": ["aurora spear", "dawn lance", "polar spear", "aurora lance", "ice storm spear"],
      "expansion": "A luminous spear of cold fire and lightning tears down a straight lane, blending piercing electric and frost damage while destabilizing enemy lines."
    },
    {
      "key": "iron tide",
      "aliases": ["iron tide", "iron wave", "metal tide", "machined tide", "forged undertow"],
      "expansion": "A wall of enchanted ferro-mist floods forward as armored fragments and pressure, pinning enemies in place while each step drives them farther from their footing."
    },
    {
      "key": "spectral chain",
      "aliases": ["spectral chain", "phantom chain", "soul chain", "haunted chain", "wraith chain"],
      "expansion": "A chain of cursed apparitions lashes between enemies, dragging and stunning survivors while phantom flames eat away at clustered defenses."
    },
    {
      "key": "frost cathedral",
      "aliases": ["frost cathedral", "frozen cathedral", "glacial cathedral", "cathedral of ice"],
      "expansion": "A monumental cathedral of mirrored ice manifests mid-lane, trapping enemies beneath a ringing dome while repeated shards fracture and chill everything that moves."
    },
    {
      "key": "sunforge",
      "aliases": ["sunforge", "solar forge", "sun hammer", "celestial forge", "sun anvil"],
      "expansion": "A hammering sun-metal sigil crashes down and ignites a radiant circle, hardening nearby air into burning plates that punish sustained presence."
    },
    {
      "key": "storm crucible",
      "aliases": ["storm crucible", "thunder crucible", "lightning crucible", "tempest crucible", "storm crucify"],
      "expansion": "A crackling crucible forms as lightning and gusts collide, cycling burst arcs and grinding enemies under a rotating storm cage."
    },
    {
      "key": "obsidian hail",
      "aliases": ["obsidian hail", "obsidian storm", "shard hail", "basalt hail", "black hail"],
      "expansion": "Dark glass hailstones rain from the void-touched sky, each shard piercing and fragmenting on contact to layer crowd-control pressure across the lane."
    },
    {
      "key": "miasma veil",
      "aliases": ["miasma veil", "toxic veil", "plague veil", "corruption veil", "dread veil"],
      "expansion": "A nauseating fog of rot and static settles low over the front lane, dulling responses and weakening armor while enemy marks persist in the cloud."
    },
    {
      "key": "celestial cage",
      "aliases": ["celestial cage", "star cage", "astral cage", "gravity cage", "heavenly prison"],
      "expansion": "Stars align into a geometric prison around clustered foes, locking their movement while starlight jabs and electric dissonance batter trapped targets."
    },
    {
      "key": "grave eclipse",
      "aliases": ["grave eclipse", "necro eclipse", "tomb eclipse", "wraith eclipse", "dread eclipse"],
      "expansion": "A deadened eclipse rolls over the lane, muting defenses and layering cold shadow with punishing burst at the center of clustered resistance."
    },
    {
      "key": "ember labyrinth",
      "aliases": ["ember labyrinth", "flame maze", "inferno maze", "burning labyrinth", "cinder maze"],
      "expansion": "A fiery labyrinth of collapsing corridors spins into existence, forcing enemies to churn through burning walls while recursive embers strike from every angle."
    },
    {
      "key": "arcane missiles",
      "aliases": ["arcane missiles", "magic missile", "arcane barrage", "mystic bolts", "mana bolts"],
      "expansion": "A rapid triple-burst of glowing arcane orbs streaks toward enemies in quick succession, each mote trailing holy light and detonating in a flash of violet energy on impact."
    },
    {
      "key": "vines",
      "aliases": ["vines", "thorn vines", "entangle", "entangling vines", "root", "vine snare", "bramble trap"],
      "expansion": "A tangle of thorny magical vines erupts from the ground, rooting enemies in place while dealing sustained puncture damage and slowing any that break free from the creeping growth."
    }
  ]
}
